""" Приложение Task Manager
    =============================================================
        консольное приложение - менеджер управления заметок,
        пользователь может создать заметку, редактировать,
        посмотреть все заметки или удалить выбранную.
    =============================================================
    ~~~~~~~~~~~~~~~~~~~~~
    | version app 0.0.7 |
    ~~~~~~~~~~~~~~~~~~~~~


    v(0.0.1)
    разработан цикл приложения - структурное программирование

    v(0.0.2)
    внедрен  i/o функционал для ввода задачи

    v(0.0.3)
    разработаны функции для цикла - функциональное программирование

    v(0.0.4)
    добавлены проверки и подтверждения

    v(0.0.5)
    созданы методы сохранения и загрузки - файловые сохранения

    v(0.0.6)
    созданы методы для удаления, редактирования и создания задач - логика вынесена из цикла

    v(0.0.7)
    основной цикл помещен в отдельный метод - def main

    v(0.0.8)
    реализован функционал добавления контента задачи - имя + содержание

    v(0.0.9)
    обновление отображения коллекции
    v(0.1.0)
    создать модули и сделать review code, сборка дилда


"""
""" Модуль с главными функциями """


from app import app

def main():
    print("Добро пожаловать!")
    app()


if __name__ == "__main__":
    main()





#if __name__=="__main__":
#    print("ghbdtn")